app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 1]]
---
					<td>
						<% user.gossips.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---

		<h2>Bienvenue <%= User.find_by(id: session[:user_id]).first_name %> !</h2>