app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<div class="text-center mt-4">
	<h1><span class="text-info"><%= @gossips.title %></span> de <a href="/user/<%= @gossips.user.id %>"><%= @gossips.user.first_name %></a>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
 <div class="text-center">
	<% @gossips.comments.each do |comment|%>
		<a href="/user/<%comment.user_id%>"><%=comment.user.first_name%></a>