app/controllers/comments_controller.rb

  def create
      gossip_id = params[:gossip_id]
      @gossips = Gossip.find(gossip_id)
      content = params["content"]
      @user = User.find(10)
      @comments = Comment.new(content: content)
      @comments.user = @user
      @comments.gossip = @gossips
      @comments.save
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "gossip_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ""], ["created_at", "2019-08-12 12:38:25.103583"], ["updated_at", "2019-08-12 12:38:25.103583"], ["user_id", 10], ["gossip_id", 4]]