app/controllers/gossips_controller.rb

  def show
      id = params['id']
      @gossips = Gossip.find(id)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
      title = params["title"]
      content = params["content"]

      @user = User.find(11)

      @gossips = Gossip.new(title: title, content: content)
      @gossips.user = @user
      @gossips.save

      if  @gossips.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "zzzzzz"], ["content", "zgsdgdfdfdf"], ["created_at", "2019-08-11 13:02:55.886336"], ["updated_at", "2019-08-11 13:02:55.886336"], ["user_id", 10]]
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "uyfuyjf"], ["content", "yhjyfuyrtf"], ["created_at", "2019-08-14 04:37:49.203533"], ["updated_at", "2019-08-14 04:37:49.203533"], ["user_id", 32]]

  def edit
      @gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
      title = params["title"]
      content = params["content"]
      @gossips = Gossip.find(params[:id])
      @gossips.update(title: title, content: content)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "teste"], ["content", "test"], ["updated_at", "2019-08-12 06:58:07.171770"], ["id", 7]]

  def destroy
      @gossips = Gossip.find(params[:id])
      @gossips.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 15]]