app/controllers/user_controller.rb

  def show
  	id = params["id"]
  	@user = User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

	def new
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def create
      @cities = City.all
      first_name = params["first_name"]
      last_name = params["last_name"]
      email = params["email"]
      description = params["description"]
      age = params["age"]
      city_id = params['city_id']
      password = params["password"]
      password_confirmation = params["password_confirmation"]

      @user = User.new(first_name: first_name,
      last_name: last_name,
      email: email,
      description: description,
      age: age,
      password: password,
      password_confirmation: password_confirmation,
)
        @city = City.find(city_id)
        @user.city = @city
        @user.save
    if @user.save
---
SELECT "cities".* FROM "cities"
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "tana"], ["created_at", "2019-08-14 04:37:32.306288"], ["updated_at", "2019-08-14 04:37:32.306288"]]
INSERT INTO "users" ("first_name", "last_name", "email", "age", "created_at", "updated_at", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"